app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT "movies".* FROM "movies"

  def create
    @movie = current_user.movies.build(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "descroption", "movie_length", "director", "rating", "created_at", "updated_at", "user_id", "trailer") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_movie
      @movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 377508964], ["LIMIT", 1]]