app/controllers/reviews_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 377508964], ["LIMIT", 1]]
---
    def set_movie
      @movie = Movie.find(params[:movie_id])